// Вывести квадрат числа
Console.WriteLine("Введите число: ");
double number = Convert.ToInt32(Console.ReadLine());
double Pow = Math.Pow(number, 2);
Console.WriteLine ($"Квадрат числа {number} равен {Pow}");
